export interface HelpRecordType {
  title: string;
  description: string;
  settings?: string;}

export function getHelpTitle(gameId: string) {
  return helpRecords.get(gameId) ? helpRecords.get(gameId)!.title : "";
}

export function getHelpDescription(gameId: string) {
  return helpRecords.get(gameId) ? helpRecords.get(gameId)!.description : "";
}

export function getHelpSettings(gameId: string) {
  return helpRecords.get(gameId) ? helpRecords.get(gameId)!.settings : "";
}

export const helpRecords: Map<string, HelpRecordType> = new Map ([
    ["colorMatch", {
      "title": "איפה יש מספר?",
      "description": "בראש העמוד מוצג מספר. על הילד להקיש על התמונה בה מופיע מספר עצמים תואם למספר. הלומדה תמתין עד שהילד יבחר בתמונה הנכונה. כשהילד יבחר בתמונה הנכונה, יוצג המספר הבא. ניתן להתאים את המשחק )דרך תפריט השליטה( ולבחור קבוצה מצומצמת יותר של מספרים שיוצגו."
    }],
    ["numberSort", {
      "title": "בתי המספרים",
      "description": "על-ידי בראש העמוד מוצגות תמונות עם מספר עצמים משתנה. בתחתית העמוד מיכלים מתאימים למספרי עצמים שונים. על הילדים לבחור מספר על-ידי הקשה על אחד המיכלים ואז לבחור את התמונות שתכנסנה למיכל שנבחר  עי הקשה עליהן, כלומר תמונות עם מספר עצמים זהה למספר שנבחר. התמונות המתאימות למספר מסוים לא חייבות להיבחר ברצף. ניתן לחזור ולבחור מספר פעם נוספת כדי לבחור תמונה נוספת. מספרים בתור בראש העמוד מוצגת רשימת מספרים מ1- עד 10 בסדר מבולבל. על הילד להקיש על המספרים לפי הסדר שלהם ברצף מ1- עד .10 מספר שנבחר במקום הנכון בסדר יועבר לתצוגת הרצף הנכון בתחתית העמוד, כך שבתום  המשחק המספרים יוצגו בסדר הנכון."
    }],
    ["letterMatch", {
      "title": "מי מתחיל באות?",
      "description": "בראש העמוד מוצגת אות. על הילד להקיש על התמונה בה מופיע עצם שמתחיל באות שהוצגה. הלומדה תמתין עד שהילד יבחר בתמונה הנכונה. כשהילד יבחר בתמונה הנכונה, תוצג האות הבאה. ניתן להתאים את המשחק )דרך תפריט השליטה( ולבחור קבוצה מצומצמת יותר של אותיות שיוצגו. ניתן לבחור    עד 10 אותיות )כדי להגביל את כמות התמונות שמוצגות לבחירה(."
    }],
    ["iWriteWords", {
      "title": "מילים מבולבלות",
      "description": "בראש העמוד מוצגת תמונה ומתחת אותיות המילה של העצם המוצג בתמונה בסדר מבולבל. על הילד להקיש על האותיות לפי הסדר הנכון שלהן במילה המתארת את העצם בתמונה. אות שנבחרה במקום הנכון בסדר תועבר    לתצוגת הרצף הנכון בתחתית העמוד, כך שבתום המשחק המילה המתארת את העצם בתמונה תוצג."
    }],
    ["colorSort", {
      "title": "בתי הצבעים",
      "description": "בראש העמוד מוצגות תמונות עם עצמים בכל מיני צבעים. בתחתית העמוד מיכלים מתאימים לצבעים שונים. על הילד לבחור צבע על-ידי הקשה על אחד המיכלים ואז לבחור את התמונות שתכנסנה למיכל שנבחר על-ידי הקשה עליהן, כלומר תמונות עם עצם בצבע זהה לצבע שנבחר. תמונות המתאימות לצבע מסוים לא חייבות להיבחר ברצף. ניתן לחזור ולבחור צבע פעם נוספת כדי לבחור תמונה נוספת."
    }],
    ["moodSort", {
      "title": "מרגישים",
      "description": "מטרת המשחק לסייע לילד בהבנת התנהגויות והבעות פנים של אנשים במצבי רוח שונים.    בראש העמוד מוצגות תמונות של אנשים במצבי רוח שונים. בתחתית העמוד מיכלים מתאימים למצבי רוח שונים. על הילד לבחור מצב רוח עי הקשה על אחד המיכלים ואז לבחור את התמונות שתכנסנה למיכל שנבחר עי הקשה עליהן, כלומר תמונות עם אנשים במצב רוח זהה למצב הרוח שנבחר. התמונות המתאימות למצב רוח מסוים לא חייבות להיבחר ברצף. ניתן לחזור ולבחור מצב רוח פעם נוספת כדי לבחור תמונה נוספת."
    }],
    ["washHands", {
      "title": "שוטפים ידיים",
      "description": "מטרת המשחק לסייע לילד להפנים את רצף הפעולות שעליו לבצע כשהוא הולך לשטוף ידיים. בראש העמוד מוצגות תמונות של הפעולות השונות אותן יש לבצע בזמן רחיצת ידיים. על הילד להקיש על התמונות לפי סדר ביצוע הפעולות. תמונה שנבחרה במקום הנכון ברצף תועבר לתצוגת הרצף הנכון בתחתית העמוד, כך שבתום המשחק הפעולות תוצגנה בסדר הנכון."
    }],
    ["bathroomRoutine", {
      "title": "הולכים לשירותים",
      "description": "מטרת המשחק לסייע לילד להפנים את רצף הפעולות שעליו לבצע כשהוא הולך לשירותים. בראש העמוד מוצגות תמונות של הפעולות השונות אותן יש לבצע בשירותים. על הילד להקיש על התמונות לפיסדר ביצוע הפעולות. תמונה שנבחרה במקום הנכון ברצף תועבר לתצוגת הרצף הנכון בתחתית העמוד, כךשבתום המשחק הפעולות תוצגנה בסדר הנכון."
    }],
    ["morningRoutine", {
      "title": "מסתדרים בבוקר",
      "description": "מטרת המשחק לסייע לילד להפנים את רצף הפעולות שעליו לבצע בבוקר כשהוא מסתדר ללכת לבית הספר.    בראש העמוד מוצגות תמונות של הפעולות השונות אותן יש לבצע בבוקר. על הילד להקיש על התמונות לפי סדר    ביצוע הפעולות. תמונה שנבחרה במקום הנכון ברצף תועבר לתצוגת הרצף הנכון בתחתית העמוד, כך שבתום    המשחק הפעולות תוצגנה בסדר הנכון"
    }],
    ["mouseJumpingShapeClick", {
      "title": "מרדף העכבר",
      "description": "על המסך מופיעה צפרדע. בכל פעם שמפעילים עליה את העכבר על-פי ההגדרות במשחק, הצפרדע קופצת למקום אחר ויש להפעיל עליה את העכבר שוב",
      "settings": "ניתן להגדיר את הפעולת העכבר שתהיה פעילה במשחק (לחיצה, לחילה כפולה)  ואת גודל הצפרדע - ככל שהצפרדע קטנה יותר המשחק קשה יותר"
    }]
  ]);
